zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_dma.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_ll_dma.c
  * @author  MCD Application Team
  * @brief   DMA LL module driver.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
 @verbatim
  ==============================================================================
                        ##### LL DMA driver acronyms #####
  ==============================================================================
  [..]  Acronyms table :
                   =========================================
                   || Acronym ||                          ||
                   =========================================
                   || SRC     ||  Source                  ||
                   || DEST    ||  Destination             ||
                   || ADDR    ||  Address                 ||
                   || ADDRS   ||  Addresses               ||
                   || INC     ||  Increment / Incremented ||
                   || DEC     ||  Decrement / Decremented ||
                   || BLK     ||  Block                   ||
                   || RPT     ||  Repeat / Repeated       ||
                   || TRIG    ||  Trigger                 ||
                   =========================================
 @endverbatim
  ******************************************************************************
  */

#if defined (USE_FULL_LL_DRIVER)

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_ll_dma.h"
#include "stm32mp2xx_ll_bus.h"
#ifdef  USE_FULL_ASSERT
#include "stm32_assert.h"
#else
#define assert_param(expr) ((void)0U)
#endif /* USE_FULL_ASSERT */

/** @addtogroup STM32MP2xx_LL_Driver
  * @{
  */

#if (defined (HPDMA1) || defined (HPDMA2) || defined (HPDMA3) || defined (LPDMA))

/** @addtogroup DMA_LL
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/

/** @addtogroup DMA_LL_Private_Macros
  * @{
  */
#if defined(CORE_CM0PLUS)
#define IS_LL_DMA_ALL_CHANNEL_INSTANCE(INSTANCE, Channel) ((((INSTANCE) == LPDMA)                 && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_3))))
#else
#if  defined(LPDMA)
#define IS_LL_DMA_ALL_CHANNEL_INSTANCE(INSTANCE, Channel) ((((INSTANCE) == HPDMA1)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_3)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_4)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_5)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_6)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_7)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_8)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_9)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_10)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_11)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_ALL))) || \
                                                           (((INSTANCE) == HPDMA2)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_3)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_4)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_5)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_6)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_7)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_8)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_9)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_10)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_11)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_ALL))) || \
                                                           (((INSTANCE) == HPDMA3)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_3)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_4)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_5)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_6)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_7)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_8)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_9)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_10)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_11)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_ALL))) || \
                                                           (((INSTANCE) == LPDMA)                 && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_3)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_ALL))))
#else
#define IS_LL_DMA_ALL_CHANNEL_INSTANCE(INSTANCE, Channel) ((((INSTANCE) == HPDMA1)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_3)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_4)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_5)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_6)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_7)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_8)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_9)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_10)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_11)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_ALL))) || \
                                                           (((INSTANCE) == HPDMA2)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_3)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_4)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_5)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_6)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_7)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_8)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_9)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_10)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_11)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_ALL))) || \
                                                           (((INSTANCE) == HPDMA3)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_3)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_4)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_5)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_6)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_7)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_8)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_9)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_10)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_11)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_ALL))))
#endif /* LPDMA */
#endif /* ! CORE_CM0PLUS */

