zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_dma.c
#if defined(CORE_CM0PLUS)
#define IS_LL_HPDMA_CHANNEL_INSTANCE(INSTANCE, Channel)   0U
#else
#define IS_LL_HPDMA_CHANNEL_INSTANCE(INSTANCE, Channel)   ((((INSTANCE) == HPDMA1)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_3)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_4)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_5)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_6)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_7)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_8)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_9)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_10)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_11)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15))) || \
                                                           (((INSTANCE) == HPDMA2)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_3)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_4)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_5)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_6)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_7)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_8)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_9)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_10)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_11)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)))  || \
                                                           (((INSTANCE) == HPDMA3)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_3)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_4)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_5)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_6)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_7)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_8)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_9)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_10)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_11)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15))))
#endif /* ! CORE_CM0PLUS */


#if defined(CORE_CM0PLUS)
#define IS_LL_DMA_2D_CHANNEL_INSTANCE(INSTANCE, Channel)  0U
#else
#define IS_LL_DMA_2D_CHANNEL_INSTANCE(INSTANCE, Channel)  ((((INSTANCE) == HPDMA1)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)))  || \
                                                           (((INSTANCE) == HPDMA2)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)))  || \
                                                           (((INSTANCE) == HPDMA3)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15))))
#endif /* ! CORE_CM0PLUS */

#define IS_LL_DMA_MODE(__VALUE__)                         (((__VALUE__) == LL_DMA_NORMAL) || \
                                                           ((__VALUE__) == LL_DMA_PFCTRL))

#if  defined(LPDMA)
#define IS_LL_DMA_PFREQ_INSTANCE(INSTANCE, Channel)       ((((INSTANCE) == HPDMA1)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)))  || \
                                                           (((INSTANCE) == HPDMA2)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)))  || \
                                                           (((INSTANCE) == HPDMA3)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)))  || \
                                                           (((INSTANCE) == LPDMA)                 && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_3))))
#else
#define IS_LL_DMA_PFREQ_INSTANCE(INSTANCE, Channel)       ((((INSTANCE) == HPDMA1)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)))  || \
                                                           (((INSTANCE) == HPDMA2)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)))  || \
                                                           (((INSTANCE) == HPDMA3)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15))))
#endif /* LPDMA */

