zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_dma.c
#define IS_LL_DMA_BURST_DEST_ADDR_UPDATE(__VALUE__)       (((__VALUE__) == LL_DMA_BURST_DEST_ADDR_INCREMENT) || \
                                                           ((__VALUE__) == LL_DMA_BURST_DEST_ADDR_DECREMENT))

#define IS_LL_DMA_BURST_ADDR_UPDATE_VALUE(__VALUE__)       ((__VALUE__) <= 0x1FFFU)

#define IS_LL_DMA_BLKRPT_SRC_ADDR_UPDATE(__VALUE__)       (((__VALUE__) == LL_DMA_BLKRPT_SRC_ADDR_INCREMENT) || \
                                                           ((__VALUE__) == LL_DMA_BLKRPT_SRC_ADDR_DECREMENT))

#define IS_LL_DMA_BLKRPT_DEST_ADDR_UPDATE(__VALUE__)      (((__VALUE__) == LL_DMA_BLKRPT_DEST_ADDR_INCREMENT) || \
                                                           ((__VALUE__) == LL_DMA_BLKRPT_DEST_ADDR_DECREMENT))

#define IS_LL_DMA_BLKRPT_ADDR_UPDATE_VALUE(__VALUE__)      ((__VALUE__) <= 0xFFFFU)

#define IS_LL_DMA_LINK_BASEADDR(__VALUE__)                (((__VALUE__) & 0xFFFFU) == 0U)

#define IS_LL_DMA_LINK_ADDR_OFFSET(__VALUE__)             (((__VALUE__) & 0x03U) == 0U)

#define IS_LL_DMA_LINK_UPDATE_REGISTERS(__VALUE__)       ((((__VALUE__) & 0x01FE0000U) == 0U) && ((__VALUE__) != 0U))

#if  defined(LPDMA)
#define IS_LL_DMA_LINK_NODETYPE(__VALUE__)                (((__VALUE__) == LL_DMA_HPDMA_2D_NODE)     || \
                                                           ((__VALUE__) == LL_DMA_HPDMA_LINEAR_NODE) || \
                                                           ((__VALUE__) == LL_DMA_LPDMA_LINEAR_NODE))
#else
#define IS_LL_DMA_LINK_NODETYPE(__VALUE__)                (((__VALUE__) == LL_DMA_HPDMA_2D_NODE)     || \
                                                           ((__VALUE__) == LL_DMA_HPDMA_LINEAR_NODE))
#endif /* LPDMA */

#if defined CORTEX_IN_SECURE_STATE
#define IS_LL_DMA_CHANNEL_SRC_SEC(__VALUE__)              (((__VALUE__) == LL_DMA_CHANNEL_SRC_NSEC) || \
                                                           ((__VALUE__) == LL_DMA_CHANNEL_SRC_SEC))

#define IS_LL_DMA_CHANNEL_DEST_SEC(__VALUE__)             (((__VALUE__) == LL_DMA_CHANNEL_DEST_NSEC) || \
                                                           ((__VALUE__) == LL_DMA_CHANNEL_DEST_SEC))

#endif /* CORTEX_IN_SECURE_STATE */
#define IS_LL_DMA_LIMIT_CHANNEL_INSTANCE(INSTANCE, Channel)    ((((INSTANCE) == HPDMA1)               && \
                                                                 (((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                                  ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                                  ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                                  ((Channel)  == LL_DMA_CHANNEL_15)))  || \
                                                                (((INSTANCE) == HPDMA2)               && \
                                                                 (((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                                  ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                                  ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                                  ((Channel)  == LL_DMA_CHANNEL_15)))  || \
                                                                (((INSTANCE) == HPDMA3)               && \
                                                                 (((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                                  ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                                  ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                                  ((Channel)  == LL_DMA_CHANNEL_15))))

/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/** @addtogroup DMA_LL_Exported_Functions
  * @{
  */

/** @addtogroup DMA_LL_EF_Init
  * @{
  */

/**
  * @brief De-initialize the DMA registers to their default reset values.
  * @note  This API is used for all available DMA channels.
  * @note  To convert DMAx_Channely Instance to DMAx Instance and Channely, use
  *        helper macros :
  *        @arg @ref LL_DMA_GET_INSTANCE
  *        @arg @ref LL_DMA_GET_CHANNEL
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_0
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  *         @arg @ref LL_DMA_CHANNEL_7
  *         @arg @ref LL_DMA_CHANNEL_8
  *         @arg @ref LL_DMA_CHANNEL_9
  *         @arg @ref LL_DMA_CHANNEL_10
  *         @arg @ref LL_DMA_CHANNEL_11
  *         @arg @ref LL_DMA_CHANNEL_12
  *         @arg @ref LL_DMA_CHANNEL_13
  *         @arg @ref LL_DMA_CHANNEL_14
  *         @arg @ref LL_DMA_CHANNEL_15
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS : DMA registers are de-initialized.
  *          - ERROR   : DMA registers are not de-initialized.
  */
uint32_t LL_DMA_DeInit(DMA_TypeDef *DMAx, uint32_t Channel)
{
  DMA_Channel_TypeDef *tmp;
  ErrorStatus status = SUCCESS;

  /* Check the DMA Instance DMAx and Channel parameters */
  assert_param(IS_LL_DMA_ALL_CHANNEL_INSTANCE(DMAx, Channel));

  if (Channel == LL_DMA_CHANNEL_ALL)
  {
#if ! defined(CORE_CM0PLUS)
    if (DMAx == HPDMA1)
    {
      /* Force reset of HDMA1 clock */
      LL_RCC_HPDMA1_ForceReset();

      /* Release reset of HDMA1 clock */
      LL_RCC_HPDMA1_ReleaseReset();
    }
    else if (DMAx == HPDMA2)
    {
      /* Force reset of HDMA2 clock */
      LL_RCC_HPDMA2_ForceReset();

      /* Release reset of HDMA2 clock */
      LL_RCC_HPDMA2_ReleaseReset();
    }
    else if (DMAx == HPDMA3)
    {
      /* Force reset of HDMA3 clock */
      LL_RCC_HPDMA3_ForceReset();

      /* Release reset of HDMA3 clock */
      LL_RCC_HPDMA3_ReleaseReset();
    }
    else
    {
#if  defined(LPDMA)
      /* Force reset of LPDMA clock */
      LL_RCC_LPDMA_ForceReset();

      /* Release reset of LPDMA clock */
      LL_RCC_LPDMA_ReleaseReset();
#endif /* LPDMA */
    }
#else
    /* Force reset of LPDMA clock */
    LL_RCC_LPDMA_ForceReset();

    /* Release reset of LPDMA clock */
    LL_RCC_LPDMA_ReleaseReset();
#endif /* ! CORE_CM0PLUS */
  }
  else
  {
    /* Get the DMA Channel Instance */
    tmp = (DMA_Channel_TypeDef *)(LL_DMA_GET_CHANNEL_INSTANCE(DMAx, Channel));

